关键字：1.数据类型 char - 字符型 short - 短整型 int - 整型 long - 长整型 long long - 更长的整型 float - 单精度浮点数 double - 双精度浮点数
         所占大小
        c语言没有字符串类型，用" "当字符串
       2.
变量：
      命名：只能由字母（包括大写和小写）、数字和下划线（ _ ）组成。
           不能以数字开头。
           长度不能超过63个字符。
           变量名中区分大小写的。
           变量名不能使用关键字。
      分类：
          一.全局变量：跟随整个程序的生命周期
          二.局部变量：出了局部变量会销毁
常量
    1.字面常量
    2.const 修饰的常变量  const int a = 10  在c语言中，const修饰的a，本质是变量，但是不能直接修改，是有常量的属性
    3.#define 定义的标识符常量
    4.枚举常量   enum  枚举常量不能改
         //	3;
         //	3.14;
         //	'w';//单引号引字符
         //	"abc";//字符串常量
         //#define MAX 100
         //#define STR "abcd"
